//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"BUILDING_ENTITY_STORE"="执行步骤 %d，共 %d 步：构建实体商店";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"CREATING_BOOTSTRAP_DATABASE"="执行步骤 %d，共 %d 步：正在创建引导数据库";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"CREATING_REQUEST_QUEUE_DATABASE"="执行步骤 %d，共 %d 步：正在创建请求队列数据库";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - received bytes; 2nd %s - total bytes.
"DOWNLOADING_ENTITY_STORE"="执行步骤 %d，共 %d 步：正在下载实体商店。目前为止，已接收 %s，共 %s。";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"ERASING_EXPIRED_REQUESTS"="执行步骤 %d，共 %d 步：清除过期请求";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"LOADING_METADATA"="执行步骤 %d，共 %d 步：正在加载元数据";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"PERFORMING_REQUEST_QUEUE_MERGE"="执行步骤 %d，共 %d 步：正在执行请求队列合并";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"PERFORMING_TRANSACTION_MERGE"="执行步骤 %d，共 %d 步：正在执行事务合并";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"PERFORMING_CREATE_DELETE_MERGE"="执行步骤 %d，共 %d 步：正在执行创建删除合并";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - request name; 2nd %s - request url.
"PROCESSING_DEFINING_QUERIES"="执行步骤 %d，共 %d 步：使用 %s 处理定义查询 %s";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - request number; 2nd %s - total request number.
"PROCESSING_REQUESTS"="执行步骤 %d，共 %d 步：处理请求。正在发送 %s 的修改请求 %s。";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"REAPPLYING_CHANGES"="执行步骤 %d，共 %d 步：重新应用更改";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"ANALYZING_RECEIVED_DATA"="执行步骤 %d，共 %d 步：正在分析收到的数据";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. %s - received bytes.
"RECEIVING_DATA_FROM_SERVER"="执行步骤 %d，共 %d 步：从服务器接收数据。目前为止，已接收 %s。";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"REMOVING_DELETED_RELATIONSHIPS"="执行步骤 %d，共 %d 步：正在移除删除的关系";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. Removing requests that have a custom http header "REMOVE_AFTER_UPLOAD". Note: the header name is a constant, please do not translate.
"REMOVING_REMOVEAFTERUPLOAD_REQUESTS"="执行步骤 %d，共 %d 步：正在移除指定为 RemoveAfterUpload 的请求";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. %s - sent bytes.
"SENDING_DATA_TO_SERVER"="执行步骤 %d，共 %d 步：将数据发送到服务器。目前为止，已发送 %s。";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - sent bytes; 2nd %s - total bytes.
"SENDING_ENTITY_STORE_DATABASE"="执行步骤 %d，共 %d 步：正在发送实体商店数据库。目前为止，已发送 %s，共 %s。";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - sent bytes; 2nd %s - total bytes.
"SENDING_REQUEST_QUEUE_DATABASE"="执行步骤 %d，共 %d 步：正在发送请求队列数据库。目前为止，已发送 %s，共 %s。";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"STARTING_COMMUNICATION_WITH_SERVER"="执行步骤 %d，共 %d 步：开始与服务器通信";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"UPLOAD_PREPROCESSING"="执行步骤 %d，共 %d 步：在上传之前预处理请求";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"WAITING_FOR_DOWNLOAD"="执行步骤 %d，共 %d 步：等待下载";
